{
    "intro" : {
        "header": "<h1>Redovisningar</h1>",
        "content": "<p>Här är mina Redovisningstexter.</p>"
    },
    "sections" : [
        {
            "header": "<h2>Kmom01</h2>",
            "content": "<h3>Allmänt</h3><p>Då var det första momentet avklarat utan några större problem. De problem jag stötte på var egentligen väldigt små och slarvfel från min sida. Momentet gick relativt fort att genomföra och var en bra introduktion till kursen och var ett vettigt första moment.</p><h3>Vilken utvecklingsmiljö sitter du på?</h3><p>Jag använder mig av en Macbook Pro med OS X 10.11.1. Som editor använder jag mig av Atom. Har i tidigare kurser använt mig av Coda och Sublime Text också men har nu fattat tycke för Atom, även om den i vissa fall inte verkar vara lika rapp som Sublime Text. På datorn finns Safari, Firefox och Chrome installerade. Safari används mest i 'privat bruk' men i utvecklingssyfte används både Firefox och Chrome för att testa hemsidorna. Redovisningstexterna skriver jag oftast med hjälp av ett Markdown program som heter Mou. Det gör jag därför att jag tycker att det är smidigare att skriva långa texter i markdown format istället för html-kod. När jag sedan känner mig nöjd med redovisningstexten kan Mou exportera texterna som html format till clipboard så att jag sen kan klistra in koden i Atom.</p><h3>Är du sedan tidigare bekant med utveckling av mobila appar?</h3><p>Jag är inte sedan tidigare bekant med att utveckla native appar till mobiler men jag har sedan tidigare gjort en webapp. Den webappen går ut på att hjälpa mig dela upp kvitton när exempelvis jag och min flickvän har varit och handlat mat men delar inte rakt av på alla råvaror då vi inte äter 100% samma kost. Den webbappen är byggd med <a href='http://materializecss.com'>Materialize</a> som är ett responsivt Material Design inspirarat framework. Appen använder sig av caching och cookies för att även fungera offline och där kakorna är tänkt att hjälpa en att bilda en uppfattning av hur mycket mat som handlas varje månad. Att använda cookies till det visade sig inte vara den bästa metoden för att spara data långsigtigt men jag har ännu inte brytt mig om att lösa sparningen på ett bättre sätt. Webappen är byggd med hjälp av jQuery.</p><p>Kanske får jag en del tips under denna kursens gång på hur jag kan förbättra min webapp.</p><h3>Är du bekant med jQuery och/eller jQuery Mobile?</h3><p>Jag är sedan tidigare inte bekant med just jQuery Mobile med jQuery har jag använt mig av tidigare både i tidigare kurser och till hobby-projekt såsom min kvitto-webapp som jag nämnde här ovan</p><h3>Hur känns det att jobba i jQuery Mobile?</h3><p>Som med så mycket annat nytt så var det en del att ta till sig. Men det är ju inget ovanligt med nya ramverk såsom jQuery Mobile. Men när man väl lär sig mer och mer om hur ramverket fungerar tror jag man snabbt kan bygga funktionella web-appar. Det kändes väldigt kraftullt hur man med hjälp av <code>.toolbar()</code> och <code>.panel()</code> kunde göra header, footer och en meny. Jag ville att min header med meny ikon skulle vara fixerad även om man scrollar och detta gjordes väldigt enkelt med hjälp av <code>data-position='fixed'</code>. Det känns kraftfullt att man kan ändra en sådan sak på ett relativt enkelt sätt.</p><h3>Var det något som krånglade eller tog extra mycket tid?</h3><p>Jag hade några problem under momentets gång men egentligen handlade det bara om slarvfel från min sida i alla fallen. Först hade jag problem att få till headern och footern som toolbar, de försvann från sidan helt. Jag testade att console-logga från <code>/js/main.js</code> men ingenting syntes i firebug. Då såg jag i firebug att main.js inte ens importerades i index.html och det visade sig att jag hade skrivit fel i script-taggen för importen av <code>/js/main.js</code>.  <br/>När jag sedan var klar med momentet och skulle validera fick jag en del konstiga problem från htmlhint. Det klagades på att 'special characters must be escaped' där htmlhint hänvisade till att några '&lt;' för divar skulle escapas. Förstod inte varför htmlhint klagade på div-taggar och tänkte först att htmlhint var konfigurerad fel på något sätt. Efter att ha inspekterad källkoden med firefox såg jag att en del kod var markerad med röd text där den röda texten indikerade att kod var felskriven. Det handlade om att jag hade missat '&#61;' när jag hade deklarerat några divar som hade <code>class='ui-content'</code>.    <br/>De krångel jag hade under momentet var alltså slarfel från min sida men det är tur att det finns bra verktyg som kan upptäcka mina slarfel</p><hr>"
        },
        {
            "header": "<h2>Kmom02</h2>",
            "content": "<h3>Allmänt</h3><p>Då var det andra momentet avklarat och även detta moment flöt på väldigt bra och var inte speciellt svårt. Även detta moment innehöll väldigt bra guider som förberedde en för momentets uppgift. Uppskattar verkligen guiderna! Överlag var det inga stora problem med själva kodningen utan mitt största problem var att få igång Android simulatorn.</p><p>Det var intressant att lösa om localStorage och dess fördelar över cookies och jag har börjat spåna på hur jag skulle kunna använda localStorage till min hobby-webapp.</p><h3>Hur känns det att jobba i jQuery Mobile, fördelar och nackdelar?</h3><p>Det känns än så länge bra att jobba i JQM. Jag börjar bli mer van med strukturen och så än vad jag var i första momentet men jag känner mig inte direkt som en expert vid det här laget.Finns säkerligen en uppsjö kvar att lära sig.</p><p>En stor fördel som jag ser med JQM är att man snabbt kan skapa dubliga mobila webapplikationer som är responsiva och kan använda sig av svepningar på ett enkelt sätt, som är ett väldigt naturligt element i den mobila världen idag. En applikaiton på en mobil förväntas ha en interaktion där svepningar inkluderas.</p><p>En nackdel som jag kan se med JQM är att det kan kanske vara svårt att få en webapp att se unik ut. Visserligen kan man ju med hjälp av egen css manupulera utseendet men det är nog en hel del att sätta sig in i då säkerligen många saker hänger ihop med varandra och om man börjar pilla och ändra på ett ställe och så fallerar det i ett annat för att komponenter hänger ihop eller så. Vill man bara ändra lite färger och så finns ju alltid ThemeRoller.  <br/>Vidare skulle en eventuell nackdel kunna vara är om JQM inte är flexibelt i den mening att det är 'my way or the highway', att JQM's sätt att lösa saker på är den enda vägen och att det inte finns mycket utrymme för improvisation och flexibilitet i hur kod och layout ska se ut.En annan nackdel, som kanske främst handlar om single-page-apps är att det kan bli väldigt mycket html-kod i en och samma fil om applikationen är avancerad och har många funktioner. Om html-koden inte dokumenteras väl och struktureras på ett bra sätt kan jag tänka mig att det väldigt lätt blir rörigt och svårt att få en överblick.</p><h3>Så här långt, känner du att du har koll på koden? Är det något särskilt du funderar på?</h3><p>Än så länge skulle jag påstå att jag har relativt bra koll på koden. Kommer nog några gånger mer gå igenom dokumentationen för de delar som rör detta kursmoment för att få ännu bättre koll på den kod momenten än så länge gott igenom.</p><h3>Hur gick det att installera simulatorn för Android?</h3><p>Ja, att installera simulatorn var det som gav mig mest problem under detta kursmoment. Det hade varit bra om guiden för installtionen påpekade att uppgradering av paket kunde ta uppåt 16gb, något som min dator inte gillade då det redan var väldigt trångt. Det såg dock ut som att alla paket installerades men jag fick problem i och med att min simulator (Nexus 6) bara visade svart skärm. Samtidigt fick jag en popup om att Java behövde uppdateras villket jag gjorde. Startade om ANdroid SDK tools men nu gick det helt plötsligt inte att välja tools i menyn, ingen dropdown meny syntes till. Jag fick då rensa lite på datorn, flytta filer till en extern hårddisk, ta bort Android SDK'n, starta om datorn och börja om med installationen av Android SDK Tools.</p><p>När jag väl hade gått igenom proceduren en gång till var det inga problem att få igång en simulator för att testa webappen.</p><h3>Var det något som krånglade eller tog extra mycket tid?</h3><p>Det som krånglade mest för mig var som sagt att få igång Android simulatorn. Vidare hade jag lite valideringsproblem, som lustigt nog kom sig av att jag skrev av kod från guiden. Men dessa problem rättades snabbt till</p><hr>"
        },
        {
            "header": "<h2>Kmom03</h2>",
            "content": "<h3>Allmänt</h3><p>Då var förhoppningsvis det tredje momentet avklarat. Jag tycker att det var ett väldigt roligt moment där json behandlades på ett väldigt bra sätt i det två olika uppgifterna.Kan inte påstå att jag stötte på några katastrofala problem utan det största hindret för mig var hur själva navigeringen i json-filerna skulle gå till. Hade alltid en webbläsare öppen där exempelvis json-filen för instagram var formaterad på ett bättre sätt så att jag enklare kunde se hur jag skulle navigera i strukturen för att komma åt det jag ville.</p><h3>Hur kändes det att jobba med applikationen jq för att söka i och visualisera JSON-filer? Är det något du kan se användning för?</h3><p>Herregud vad jq kändes kraffullt. Med så lite kod kunde man på enkla sätt presentera json-data precis hur man ville. Jq kändes väldigt användarvänligt och kan kunde verkligen förstå vad kodraderna gjorde när jag arbetade med den uppgiften som handlade om jq.</p><h3>Hur är din generella uppfattning om jQueryMobile (och jQuery) nu efter tre kursmoment?</h3><p>Min uppfattning om jQM och jQ är att de bägge är kraftfulla sätt att arbeta på. Som den ena guiden för momentet påpekade kan det ibland vara begränsande med ett framework på det här sättet och det kan jag ändå hålla med om. Som med mycket allt annat har jQM och jQ sina för- och nackdelar. Det gäller att se över situationen och se om man kan dra nytta av exempelvis jQM i ett projekt eller om man bara 'bygger in sig i ett hörn'.</p><h3>Var det något extra du gjorde i uppgiften som du vill berätta om?</h3><p>Kan inte påstå att jag gjorde något extra direkt. Det enda jag gjorde som kanske kan anses som extra var att i listflödet med instagram-bilder valde att visa thumbnails som gick att få tag på via json-dokumentet. När man sedan klickar på en bild i listan laddas istället en standard upplösning av bilden. </p><h3>Var det något som krånglade eller tog extra mycket tid?</h3><p>Det som krånglade mest för mig var som jag nämnde tidigare, att navigera i json. Visste först inte riktigt hur jag skulle få fram alla kommentarer knutna till en bild. Insåg dock tillslut att ytterliggare en .forEach() skuulle lösa mitt problem där jag loopade igenom kommentarernas data och lyckades på så sätt komma åt varje individuell kommentar. </p><p>Vidare hade jag lite svårt att lösa några deluppgifter i första uppgiften, de som gav lite mer poäng. Hade lite svårt att använda pipe efter att ha gjort en select() på det jag ville komma åt. Visste inte riktigt hur jag skulle pipe'a vidare det hela men när jag lyckades komma fram till rätt väg kändes lösningen verkligen självklar.</p>"
        },
        {
          "header": "<hr><h2>Kmom04</h2>",
          "content": "<h3>Allmänt</h3><p>Då var det fjärde kursmomentet avklarat som på det stora hela har rullat på väldigt bra utan katastrofala problem.</p><h3>Är du sedan tidigare bekant med Mithril eller andra JavaScript-baserade MVC ramverk?</h3><p>Jag är inte sedan tidigare bekant med just Mithril men jag har nosat lite på Angular och använt mig av det, men inte speciellt mycket. Använde mig lite av Angular i mitt projektarbete i en av javascript-kurserna här på dbwebb.</p><h3>Hur känns det att jobba med Mithril?</h3><p>I början kändes det hela med Mithril krångligt och svårt att jobba med. Men det är väl så när man börjar använda ett nytt ramverk så det var inget ovanligt att det var krångligt i början. Men med hjälp av övningsuppgiften fick jag tillslut bättre kläm på det hela men känner samtidigt att jag har mycket mer att lära och är än något osäker på vissa delar. Får läsa dokumentationen mer för att känna mig säkrare på Mithril.</p><p>Var lite osäker på var json-filerna (redovisning osv) skulle läggas för uppgiften men då det handlar om filer som förmodligen kommer återanvändas om vi kommer fortsätta jobba med Mithril i ett senare kursmoment så lade jag mina json-filer i me/lib/mithril/json</p><h3>Vad tycker du om sättet som templates och Handlebars fungerar?</h3><p>Templates och Handlebars kändes som ett kraftfullt verktyg måste jag säga men det var även ett koncept som var något familjärt för mig. Har tidigare, bara som hastigast, provat på några så kallade flat-file cms där bland annat <a href='http://twig.sensiolabs.org'>twig</a> har används som är en template engine för php. Syntaxen som Twig skrivs med påminner om Handlebars väldigt mycket tycker jag.</p><p>Men som sagt, jag gillar konceptet med templates och Handlebars.</p><h3>Var det något som krånglade eller tog extra mycket tid?</h3><p>Något som krånglade var väl själva inlärningskurvan med att använda Mithril. Men det förväntade jag mig också då det är ett MVC-ramverk. Att Mithril dock var relativt lättläst gjorde att inlärningskurvan och första intrycket av det inte var ett så förvirrande och frustrerande som det annars kan bli med MVC-ramverk för min del.</p><p>Annars hade jag en del krångel med att formatera om mina redovisningstexter för json-format. Dels var det tradigt att få alla paragrafer och headings på en och samma rad men jag behövde även se över redovisningstexterna och byta ut dubbelfnuttar till enkelfnuttar vilket jag hade på en del ställen tack vare länkar i redovisningstexten bland annat. Att ha så mycket content i ett json-value kändes inte riktigt optimalt.</p>"
        },
        {
          "header": "<hr><h2>Kmom05</h2>",
          "content": "<h3>Allmänt</h3><p>Då var det femte momentet klart och det det var lite uppfriskande att upplägget av momentet var så pass fritt. Kändes nästan som ett litet mini-projektarbete. Dock</p><h3>Berätta utförligt vilka val du gjorde och hur din app fungerar</h3><p>Då jag inte visste hur jag skulle skapa själva kundvagnen valde jag en lösa alla de andra kraven på relativt enkla sätt, för att inte fastna alldeles för mycket och låta tiden rinna iväg för mycket.</p><p>Jag använder mig av jquery mobile för att kunna skapa en responsiv layout relativt snabbt. Jquery mobile tillät mig att helt fokusera på appens funktionalitet istället för styling, vilket var skönt. Vidare använde jag mig av jquery mobile då jag på förhand visste att jag ville använda popups, bland annat i form av konfirmationsruta när man vill rensa hela kundvagnen. Kanske hade det på ett relativt enkelt sätt implementera popups med Mitrhil men jquery mobiles dokumentation för detta var så pass bra att det vart ytterligare en anledning att välja jquery mobile.</p><p>Då jag som sagt inte visste hur jag skulle implementera kundvagnen valde jag att ta en snabb väg för att implementera de andra kraven och kodade mycket direkt in i sidan. Hela tiden när jag kodade in mycket i sidan kände jag att jag kodade in för mycket i sidan och att jag jobbade på ett oeffektivt sätt. Tillslut flyttade jag en del kod från själva html-sidan och valde att skapa javascript object som innehöll all information om de olika pizzorna. Detta var en mycket flexiblare lösning och inte avsevärt mycket svårare att implementera. Nu behövde jag bara ändra exempelvis pris för en pizza i javascript objektet på ett ställa istället för på två ställen i html-koden.</p><p>Vidare kändes det som att jag faktiskt hade valt fel som inte valde Mitrhil och Handlebars när jag skulle skappa strukturen för pizza menyn och kundvagnslistan då dessa verktyg hade varit flexiblare att använda för detta jobb, men nu var uppgiften redan för långt gången för att byta.</p><p>När det var dags att skapa kundvagnen valde jag att använda mig av sessionStorage för att hålla koll på hur många av varje pizzasort som var beställda. Jag använder mig av sessionStorage just för att värden inte behöver sparas om webbläsaren stängs ned, värdena behöver endast sparas för den aktuella sessionen.</p><p>Appen fungerar som sådant att man möts av startsidan där info om pizzerian finns samt en bild inifrån pizzerian. Med hjälp av en footer navigerar man i appen och det finns 4 olika möjligheter till navigering: Hem, meny, beställning och kontakt.</p><p>Menysidan består av en liten text om hur menyn fungerar samt en lista med alla pizzor som finns tillgängliga. I varje lista finns även en knapp med plustecken på, klickar man på denna läggs 1 pizza av den sorten i beställningen/varukorgen. Klickar man på en pizza kommer man till en info-sida där all info om den pizzan visas (som kommer från ett javascript object). Med svepning kan man navigera tillbaka till menyn.Menyn och undersidorna skrivs ut med hjälp av en funktion och javascript objekten som representerar pizzorna.</p><p>Beställningssidan är en info text om hur beställningen går till samt lång tabell där alla tillgängliga pizzor finns listade. Tabellen visar hur många pizzor av varje sort som är beställda och längst ned ser man totalsumman samt två knappar, en för att köpa och en för att rensa hela beställningen. Då tabellen tyvärr inte uppdateras i realtid finns det även en knapp långt upp där man kan klicka för att ladda om sidan och detta måste man göra för att kunna se förändringar som man gjort. På grund av tidsbrist lyckades jag inte uppdatera kundvagnen på ett bättre sätt.På beställningssidan finns det lite olika knappar som gör olika saker. Bland annat går det att ta bort individuella pizzor, ta bort alla pizzor av samma sort samt rensa beställningen totalt.</p><p>Sist men inte minst så finns det en kontakt-sida men kontaktinformation om pizzerian. Initialt fanns det också en div som visade en karta med hjälp av google maps där pizzerian ligger. Denna karta tog jag bort i ett senare skede då kartan gjorde att laddningen av sidan blev för lång i samband med att man måste uppdatera kundvagnen hela tiden.</p><h3>Fick du göra prioriteringar för att hålla dig inom max 20h, berätta om dem</h3><p>Då jag från början ville hålla mig inom tidsramarna för momentet valde jag att inte använda mig av json-filer för att presentera information om pizzorna eller verksamheten. Jag visste inte riktigt hur jag skulle skapa kundvagnen och således ville jag få undan de andra kraven relativt fort för att kunna fokusera min tid på att skapa kundvagnen.</p><p>När kundvagnen väl var på plats med duglig funktionalitet hade tiden ändå runnit iväg och för att inte överskrida 20h alldeles för mycket blev det ingen bättre lösning för att uppdatera kundvagnen än att manuellt klicka på en knapp för att ladda om kundvagnen.</p><h3>Gjorde du något som du är extra stolt/nöjd över i din app, berätta om det</h3><p>Något jag är extra nöjd med är att jag lade till en så kallad apple-touch-icon i index-sidans head. Detta innebär att när jag sparar webappen på hemskärmen på min iPhone så får bokmärket en ikon. Det gör ju att webappen känns mer native. Dock lade jag inte till möjlighet för android-enheter att se en ikon, då jag inte prioriterade detta.</p><p>Vidare är jag lite extra nöjd med att det finns två olika knappar som sköter borttagning av pizzor från kundvagnen. Låt säga att det finns 3 stycken calzone i kundvagnen. Den ena knappen tar bort alla calzone medan den andra knappen endast tar bort en calzone, så blir det två kvar.</p><h3>Var det något som krånglade eller tog extra mycket tid?</h3><p>Det som krånglade mest för mig var att försöka förstå varför jag fick en massa valideringsfel av mitt användande av sessionStorage. Läs mer om detta i rubriken nedanför.</p><p>Annars hade jag en del problem med att min kundvagn måste manuellt laddas om för att förändringar ska kunna ses. Tack vare av att momentet skulle ha tagit alldeles för lång tid valde jag att inte lägga ner någon mer energi på detta problem och således vart det en liten ful-lösning angående uppdatering av kundvagnen.</p><h3>Validering av sessionStorage</h3><p>När jag skulle validera min kod klagades det på att sessionStorage is not defined och detta är ett problem jag ägnade mycket tid av felsökning på. Jag tog min kod och körde den igenom jshint.com och där var det inga klagomål så jag insåg att det måste vara något med dbwebbs validering. Efter mycket felsökningstid och googlande gav jag upp för dagen.Efter att ha sovit på saken och  ytterligare en del googling insåg jag att jag kanske behövde skriva window.sessionStorage istället för bara sessionStorage när jag deklarerade och använde mitt sessionStorage. Då klagade inte dbwebb valideringen längre. Att ett sådant enkelt problem fick ta så mycket tid…</p>"
        },
        {
          "header": "<hr><h2>Kmom06</h2>",
          "content": "<h1>Allmänt</h1><p>Då var det sjätte och sista momentet avklarat innan projektet drar igång. Jag måste säga att detta moment var ovanligt litet i sin omfattning och ovanligt snabbt och smärtfritt att genomföra för att vara ett sjätte moment. Kanske har jag misstolkat kraven, vi får se.</p><h1>Har du några förkunskaper om native, hybrid, webappar?</h1><p>Jag har noll erfarenhet när det gäller native och hybrid-appar. Måste säga att hybrid låter väldigt intressant och låter verkligen som en brygga mellan native och web. Webappar har jag någorlunda förkunskaper om sedan tidigare men kallar mig inte direkt expert på området.</p><h1>Hur känner du inför konceptet med hybrid webappar?</h1><p>Hybrid webapp känns verkligen som bryggan mellan native och renodlade webappar. Beroende på vad man vill få ut av en app passar såklart olika koncept bättre och sämre. En fråga som dök upp under detta moment är hur pass snabb exempelvis Cordova är på att implementera nya native-app funktioner med hjälp av hybrid-konceptet. Tänker då på iOS nya 3D Touch som nyss lanserades i höstas och som appar nu håller på att uppdateras för att stödja. För att en app ska kunna ligga i framkant kanske det helt enkelt krävs att den är native? Är appen hybrid måste man förlita sig på att någon annan (Cordova i det här fallet) lyckas brygga den nya funktionaliteten till sitt hybrida koncept.Nu råkar det vara så att det verkar som att det redan finns plugins för 3D Touch men det känns ändå som det ligger en viss ovisshet över hybrida webbappar. Dock vet jag inte hur pass lång tid efter 3D touch introducerades som detta plugin skapades. På en app-marknad med hård konkurrens är det viktigt att ”vara först” för att lyckas och när nya tekniker lanseras såsom 3D Touch är hybrid-apparna verkligen inte först.</p><h1>Hur gick det att installera och komma igång med Cordova?</h1><p>På det stora hela gick det bra att installera och komma igång med Cordova med hjälp av foruminläggen. Inget nytt att jobba med ett cli så det var inga problem att komma igång med den biten av Cordova heller.</p><h1>Vilken/vilka plattformar använde du och vilket/vilka operativsystem testade du på?</h1><p>Jag använde mig av Android, Firefox OS och browser som plattformar / operativsystem och det var väl mest Android och Firefox OS som testades.</p><h1>Berätta om din pizza-applikation, gjorde du någon vidareutveckling?</h1><p>Jag gjorde inte direkt någon vidareutveckling tyvärr, har en annan kurs denna vecka som behövde uppmärksamheten istället.</p><h1>Var det något som krånglade eller tog extra mycket tid?</h1><p>Det första  som egentligen krånglade var att få till PATH i forumsinlägget för android. Visste inte riktigt exakt vilka path jag skulle använda men efter lite trixande fick jag till det.Sedan hade jag lite svårt att få ikonerna att visas men efter lite googling och läsning i dokumentationen för Cordova fick jag till det.</p><p>Vidare verkar det som att Firefox OS inte har stöd för det där splashscreen plugin som forumsinlägget tipsade om, om man kollar <a href='http://mozilla-cordova.github.io'>här</a> under plugin status så jag antog att splashscreen endast ska fungera till android.</p><p>Jag hade även problem med hur jag skulle göra med filer som behövdes från /lib. Fick inte riktigt till det utan fick lägga till de filer därifrån som jag behövde i Cordova projektet. Detta leder väl till en del valideringsproblem, men jag vet faktiskt inte hur det annars ska kunna lösas.</p>"
        }
    ]
}
